# PlanTopologies Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..PlanTopologies Property
Document Class See Also
---
Get the PlanTopologies of the current project in the last phase.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PlanTopologySet PlanTopologies { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PlanTopologies As PlanTopologySet
	Get
```

Visual C++
---
```text
public:
property PlanTopologySet^ PlanTopologies {
	PlanTopologySet^ get ();
}
```

# Remarks
Accessing plan topologies requires that document is modifiable as it will actually trigger calculating plan topologies if they have not been calculated yet. The time necessary for the calculations may be significant and should be considered.
# See Also
Document Class
PlanTopologies Overload
Autodesk.Revit.DB Namespace